Autodesk.Revit.DB.Structure.Rebar.EnableHookLengthOverride(System.Boolean)
Enables or disables the ability to override hook lengths for this rebar instance.
enable:
True to enable, False to disable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2021

Autodesk.Revit.DB.Structure.Rebar.SetHookRotationAngle(System.Double,System.Int32)
Sets the out of plane hook rotation angle at the specified end.
hookRotationAngle:
The out of plane hook rotation angle at the specified end.
iEnd:
0 for the start , 1 for the end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
iEnd must be 0 or 1.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2021

Autodesk.Revit.DB.Structure.Rebar.SetEndTreatmentTypeId(System.Int32,Autodesk.Revit.DB.ElementId)
Sets the id of the EndTreatmentType to be applied to the rebar.
This can be done if and only if the end of the bar on which the end treatment is applied has no RebarCoupler on it, otherwise will throw an exception.
If a RebarHookType is present at the rebar end, it will automatically set to invalidElementId.
end:
0 for the start end treatment, 1 for the end end treatment.
endTreatmentTypeId:
The id of a EndTreatmentType element, or invalidElementId if
the rebar should have no end treatment at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the parameter endTreatmentTypeId is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the Rebar end end has a RebarCoupler on it.
Since:
2021

Autodesk.Revit.DB.Structure.Rebar.SetHookTypeId(System.Int32,Autodesk.Revit.DB.ElementId)
Set the id of the RebarHookType to be applied to the rebar.
If an EndTreatmentType is present at the rebar end, it will automatically set to invalidElementId.
end:
0 for the start hook, 1 for the end hook.
hookTypeId:
The id of a RebarHookType element, or invalidElementId if
the rebar should have no hook at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookTypeId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.CreateFromCurvesAndShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Double,System.Double,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of a shape driven Rebar element within the project.
The instance will have the default shape parameters from the RebarShape.
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true,
then curves, hook types and hook rotation angles should match the rebar shape definition.
Otherwise, the hooks can be different than the defaults specified in the RebarShape.
If the RebarShapeDefinesEndTreatment flag in ReinforcementSettings has been set to true,
then curves and end treatment types should match the rebar shape definition.
Otherwise, the end treatment types can be different than the defaults specified in the RebarShape.
doc:
A document.
rebarShape:
A RebarShape element that defines the shape of the rebar.
A RebarShape element that matches curves, hooks, hook rotation angles and End Treatment.
A RebarShape element that provides the RebarStyle of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
host:
The element to which the rebar belongs. The element must support rebar hosting;
Autodesk::Revit::DB::Structure::RebarHostData.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
hookRotationAngleAtStart:
The out of plane hook rotation angle at the start of the bar.
hookRotationAngleAtEnd:
The out of plane hook rotation angle at the end of the bar.
endTreatmentTypeIdAtStart:
The end treatment type id at the start of the bar.
endTreatmentTypeIdAtEnd:
The end treatment type id at the end of the bar.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
-or-
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
-or-
the parameter endTreatmentTypeIdAtStart is not an EndTreatmentType element.
-or-
the parameter endTreatmentTypeIdAtEnd is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and RebarShape style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rebarShape does not match curves.
Since:
2021

Autodesk.Revit.DB.Structure.Rebar.CreateFromCurvesAndShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Creates a new instance of a shape driven Rebar element within the project.
The instance will have the default shape parameters from the RebarShape.
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true,
then both the curves and hooks must match the RebarShape definition.
Otherwise, the hooks can be different than the defaults specified in the RebarShape
doc:
A document.
rebarShape:
A RebarShape element that defines the shape of the rebar.
A RebarShape element matches curves and hooks.
A RebarShape element provides RebarStyle of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
host:
The element to which the rebar belongs. The element must support rebar hosting;
Autodesk::Revit::DB::Structure::RebarHostData.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
-or-
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and RebarShape style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rebarShape does not match curves.
Since:
2013

Autodesk.Revit.DB.Structure.Rebar.RebarShapeMatchesCurvesHooksAndEndTreatment(Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Double,System.Double,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Checks if rebarShape matches curves, hooks and end treatment.
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, then this method will ignore the hook information.
If the RebarShapeDefinesEndTreatment flag in ReinforcementSettings has been set to false, then this method will ignore the end treatment information.
rebarShape:
A RebarShape element that defines the shape of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
hookRotationAngleAtStart:
The out of plane hook rotation angle at the start of the bar.
hookRotationAngleAtEnd:
The out of plane hook rotation angle at the end of the bar.
endTreatmentTypeIdAtStart:
The end treatment type id at the start of the bar.
endTreatmentTypeIdAtEnd:
The end treatment type id at the end of the bar.
Returns:
True if rebarShape matches curves and hooks.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
-or-
the parameter endTreatmentTypeIdAtStart is not an EndTreatmentType element.
-or-
the parameter endTreatmentTypeIdAtEnd is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2021

Autodesk.Revit.DB.Structure.Rebar.RebarShapeMatchesCurvesAndHooks(Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Checks if rebarShape matches curves and hooks.
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, then this method will ignore the hook information.
rebarShape:
A RebarShape element that defines the shape of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Returns:
True if rebarShape matches curves and hooks.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Structure.Rebar.CreateFromRebarShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new shape driven Rebar, as an instance of a RebarShape.
The instance will have the default shape parameters from the RebarShape,
and its location is based on the bounding box of the shape in the shape definition.
Hooks are removed from the shape before computing its bounding box.
If appropriate hooks can be found in the document, they will be assigned arbitrarily.
doc:
A document.
rebarShape:
A RebarShape element that defines the shape of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
host:
The element to which the rebar belongs. The element must support rebar hosting;
Autodesk::Revit::DB::Structure::RebarHostData.
origin:
The lower-left corner of the shape's bounding box will be placed at this point in the project.
xVec:
The x-axis in the shape definition will be mapped to this direction in the project.
yVec:
The y-axis in the shape definition will be mapped to this direction in the project.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVec has zero length.
-or-
yVec has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2009

Autodesk.Revit.DB.Structure.Rebar.CreateFromCurves(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Double,System.Double,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean,System.Boolean)
Creates a new instance of a shape driven Rebar element within the project.
doc:
A document.
style:
The usage of the bar, "standard" or "stirrup/tie".
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
host:
The element to which the rebar belongs. The element must support rebar hosting;
Autodesk::Revit::DB::Structure::RebarHostData.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
hookRotationAngleAtStart:
The out of plane hook rotation angle at the start of the bar.
hookRotationAngleAtEnd:
The out of plane hook rotation angle at the end of the bar.
endTreatmentTypeIdAtStart:
The end treatment type id at the start of the bar.
endTreatmentTypeIdAtEnd:
The end treatment type id at the end of the bar.
useExistingShapeIfPossible:
Attempts to assign a RebarShape from those existing in the document. If no shape matches, this function returns null if createNewShape is false or it will create a new shape if createNewShape is true.
When both parameters are "true", the behavior is the same as sketching rebar in the UI. At least one of these parameters must be "true".
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, and a RebarShape cannot be found with both matching curves and hooks,
then this method will perform a second search, ignoring hook information.
createNewShape:
Creates a shape in the document to match the curves, hooks, and style specified, and assigns it to the new rebar instance.
Shape creation will not succeed unless one or more other shapes already exist in the document, and these shapes
have enough shape parameters to define a shape for these curves.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
-or-
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
-or-
the parameter endTreatmentTypeIdAtStart is not an EndTreatmentType element.
-or-
the parameter endTreatmentTypeIdAtEnd is not an EndTreatmentType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Both useExistingShapeIfPossible and createNewShape are false.
-or-
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and bar style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2021

Autodesk.Revit.DB.Structure.Rebar.CreateFromCurves(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Boolean,System.Boolean)
Creates a new instance of a shape driven Rebar element within the project.
doc:
A document.
style:
The usage of the bar, "standard" or "stirrup/tie".
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
host:
The element to which the rebar belongs. The element must support rebar hosting;
Autodesk::Revit::DB::Structure::RebarHostData.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
useExistingShapeIfPossible:
Attempts to assign a RebarShape from those existing in the document. If no shape matches, this function returns null if createNewShape is false or it will create a new shape if createNewShape is true.
When both parameters are "true", the behavior is the same as sketching rebar in the UI. At least one of these parameters must be "true".
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, and a RebarShape cannot be found with both matching curves and hooks,
then this method will perform a second search, ignoring hook information.
createNewShape:
Creates a shape in the document to match the curves, hooks, and style specified, and assigns it to the new rebar instance.
Shape creation will not succeed unless one or more other shapes already exist in the document, and these shapes
have enough shape parameters to define a shape for these curves.
Returns:
The newly created Rebar instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element host was not found in the given document.
-or-
host is not a valid rebar host.
-or-
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Both useExistingShapeIfPossible and createNewShape are false.
-or-
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and bar style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2009